org/gtd.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-02-22 Sat 22:25>
#+TITLE: GTD

#+BEGIN_QUOTE
凡事预则立，不预则废。
#+END_QUOTE

* IBX

* NEX

* CAL

** CALENDAR H5 应用表单生成器
   SCHEDULED: <2020-05-25 Mon>
   - State "CALENDAR"   from "TODO"       [2020-05-26 Tue 09:08]
 [2020-05-26 Tue 09:08]

- [X] 单行文本
- [X] 多行文本
- [X] 数字文本
- [X] 单选框组
- [X] 金额
- [X] 部门
- [X] 多选框组
- [X] 日期
- [X] 日期区间
- [X] 地点
- [X] 说明文字
- [ ] 关联审批单
- [X] 计算公式
- [X] 盖章
- [X] 签名
- [X] 联系人
- [X] 文件
- [X] 图片
- [ ] 明细

** CALENDAR 关联审批单
   SCHEDULED: <2020-05-19 Tue>
   - State "CALENDAR"   from "WAIT"       [2020-05-19 Tue 11:34]
   - State "WAIT"       from "WAIT"       [2020-05-08 Fri 10:45] \\
     具体开发方案待确定。
   - State "WAIT"       from "CALENDAR"   [2020-05-08 Fri 10:13] \\
     等待产品反馈具体流程。
   - State "CALENDAR"   from "TODO"       [2020-05-08 Fri 09:39]
 [2020-05-08 Fri 09:36]

- [X] 看原型了解基本需求；
- [ ] 完成编码。

** CALENDAR 表单设计中数值类型有条件限制时设置提示语
   SCHEDULED: <2020-05-25 Mon>
   - State "CALENDAR"   from "TODO"       [2020-05-20 Wed 09:06] \\
     H5 应用的时候处理提示语部分。
 [2020-05-19 Tue 09:21]

** CALENDAR 流程设计发起人、审批人、抄送人高级选项
   SCHEDULED: <2020-05-18 Mon>
   - State "CALENDAR"   from "TODO"       [2020-05-19 Tue 09:10]
 [2020-05-19 Tue 09:08]

* PRJ
** PROJECT 阅读 JavaScript 书籍
   - State "PROJECT"    from "TODO"       [2020-05-09 Sat 10:51] \\
     - 《高级 JavaScript 程序设计》
     - 《你不知道的 JavaScript 》
 [2020-05-08 Fri 19:14]

** PROJECT 简要了解整个 Web 开发技术栈
   - State "PROJECT"    from "SOMEDAY"    [2020-05-09 Sat 11:21] \\
     概要了解，不要深入，用来关注当前领域范围和趋势。
   - State "SOMEDAY"    from "TODO"       [2020-05-08 Fri 09:39]
 [2020-05-07 Thu 19:17]

参阅该清单 [[file:web-developer-roadmap.org][Web Developer Roadmap ←]] 。

* WAT

** WAIT 系统模板配置
   - State "WAIT"       from "CALENDAR"   [2020-05-21 Thu 09:23] \\
     等待产品去做。
   - State "CALENDAR"   from "TODO"       [2020-05-21 Thu 09:23]
 [2020-05-21 Thu 09:23]

* MAY

** SOMEDAY 制作饮食、睡眠、运动计划清单
   - State "SOMEDAY"    from "TODO"       [2020-05-20 Wed 09:07] \\
     尽快哦！
 [2020-05-19 Tue 10:28]

** SOMEDAY GTD 整理
   - State "SOMEDAY"    from "TODO"       [2020-05-07 Thu 09:21]
 [2020-05-01 Fri 20:51]

** SOMEDAY 清理导航页书签
   - State "SOMEDAY"    from "TODO"       [2020-05-07 Thu 09:22] \\
     利用零碎时间进行处理。
 [2020-05-06 Wed 18:11]

** SOMEDAY 了解 Websocket 即时通讯
   - State "SOMEDAY"    from "TODO"       [2020-05-07 Thu 14:08] \\
     H5 应用端及时消息要用到该技术栈。
 [2020-05-07 Thu 09:36]

** SOMEDAY 深入了解 Java 技术栈
   - State "SOMEDAY"    from "TODO"       [2020-05-08 Fri 09:37]
 [2020-05-07 Thu 19:06]

* DNE
** DONE 编辑模板
   SCHEDULED: <2020-05-20 Wed>
   - State "DONE"       from "CALENDAR"   [2020-06-03 Wed 09:02]
   - State "CALENDAR"   from "TODO"       [2020-05-20 Wed 09:05]
 [2020-05-20 Wed 09:05]

** DONE 流程设计条件高级设置
   SCHEDULED: <2020-05-19 Tue>
   - State "DONE"       from "CALENDAR"   [2020-06-03 Wed 09:01]
   - State "CALENDAR"   from "TODO"       [2020-05-19 Tue 09:10]
 [2020-05-19 Tue 09:09]

