public/gtd.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-06-06 Sat 15:39 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>GTD</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">GTD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org74f608e">IBX</a></li>
<li><a href="#org2b53bbc">NEX</a></li>
<li><a href="#orga340a52">CAL</a>
<ul>
<li><a href="#orgbf5b2f6"><span class="todo CALENDAR">CALENDAR</span> H5 应用表单生成器</a></li>
<li><a href="#org092855f"><span class="todo CALENDAR">CALENDAR</span> 关联审批单</a></li>
<li><a href="#org9747ea5"><span class="todo CALENDAR">CALENDAR</span> 表单设计中数值类型有条件限制时设置提示语</a></li>
<li><a href="#org2afd4e8"><span class="todo CALENDAR">CALENDAR</span> 流程设计发起人、审批人、抄送人高级选项</a></li>
</ul>
</li>
<li><a href="#orgad2ad10">PRJ</a>
<ul>
<li><a href="#org666615e"><span class="todo PROJECT">PROJECT</span> 阅读 JavaScript 书籍</a></li>
<li><a href="#org6d615d4"><span class="todo PROJECT">PROJECT</span> 简要了解整个 Web 开发技术栈</a></li>
</ul>
</li>
<li><a href="#orgb055967">WAT</a>
<ul>
<li><a href="#org9654d72"><span class="todo WAIT">WAIT</span> 系统模板配置</a></li>
</ul>
</li>
<li><a href="#orgd5c12fc">MAY</a>
<ul>
<li><a href="#org873ee8b"><span class="todo SOMEDAY">SOMEDAY</span> 制作饮食、睡眠、运动计划清单</a></li>
<li><a href="#orge51195f"><span class="todo SOMEDAY">SOMEDAY</span> GTD 整理</a></li>
<li><a href="#org0ae529f"><span class="todo SOMEDAY">SOMEDAY</span> 清理导航页书签</a></li>
<li><a href="#org1444c15"><span class="todo SOMEDAY">SOMEDAY</span> 了解 Websocket 即时通讯</a></li>
<li><a href="#org4d4b79d"><span class="todo SOMEDAY">SOMEDAY</span> 深入了解 Java 技术栈</a></li>
</ul>
</li>
<li><a href="#org144e603">DNE</a>
<ul>
<li><a href="#org8c9efeb"><span class="done DONE">DONE</span> 编辑模板</a></li>
<li><a href="#org0f2afa5"><span class="done DONE">DONE</span> 流程设计条件高级设置</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
凡事预则立，不预则废。
</p>
</blockquote>

<div id="outline-container-org74f608e" class="outline-2">
<h2 id="org74f608e">IBX</h2>
</div>

<div id="outline-container-org2b53bbc" class="outline-2">
<h2 id="org2b53bbc">NEX</h2>
</div>

<div id="outline-container-orga340a52" class="outline-2">
<h2 id="orga340a52">CAL</h2>
<div class="outline-text-2" id="text-orga340a52">
</div>
<div id="outline-container-orgbf5b2f6" class="outline-3">
<h3 id="orgbf5b2f6"><span class="todo CALENDAR">CALENDAR</span> H5 应用表单生成器</h3>
<div class="outline-text-3" id="text-orgbf5b2f6">
<ul class="org-ul">
<li>State "CALENDAR"   from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-26 Tue 09:08]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-26 Tue 09:08]</span></span>
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 单行文本</li>
<li class="on"><code>[X]</code> 多行文本</li>
<li class="on"><code>[X]</code> 数字文本</li>
<li class="on"><code>[X]</code> 单选框组</li>
<li class="on"><code>[X]</code> 金额</li>
<li class="on"><code>[X]</code> 部门</li>
<li class="on"><code>[X]</code> 多选框组</li>
<li class="on"><code>[X]</code> 日期</li>
<li class="on"><code>[X]</code> 日期区间</li>
<li class="on"><code>[X]</code> 地点</li>
<li class="on"><code>[X]</code> 说明文字</li>
<li class="off"><code>[&#xa0;]</code> 关联审批单</li>
<li class="on"><code>[X]</code> 计算公式</li>
<li class="on"><code>[X]</code> 盖章</li>
<li class="on"><code>[X]</code> 签名</li>
<li class="on"><code>[X]</code> 联系人</li>
<li class="on"><code>[X]</code> 文件</li>
<li class="on"><code>[X]</code> 图片</li>
<li class="off"><code>[&#xa0;]</code> 明细</li>
</ul>
</div>
</div>

<div id="outline-container-org092855f" class="outline-3">
<h3 id="org092855f"><span class="todo CALENDAR">CALENDAR</span> 关联审批单</h3>
<div class="outline-text-3" id="text-org092855f">
<ul class="org-ul">
<li>State "CALENDAR"   from "WAIT"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-19 Tue 11:34]</span></span></li>
<li>State "WAIT"       from "WAIT"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-08 Fri 10:45] </span></span> <br>
具体开发方案待确定。</li>
<li>State "WAIT"       from "CALENDAR"   <span class="timestamp-wrapper"><span class="timestamp">[2020-05-08 Fri 10:13] </span></span> <br>
等待产品反馈具体流程。</li>
<li>State "CALENDAR"   from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-08 Fri 09:39]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-08 Fri 09:36]</span></span>
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 看原型了解基本需求；</li>
<li class="off"><code>[&#xa0;]</code> 完成编码。</li>
</ul>
</div>
</div>

<div id="outline-container-org9747ea5" class="outline-3">
<h3 id="org9747ea5"><span class="todo CALENDAR">CALENDAR</span> 表单设计中数值类型有条件限制时设置提示语</h3>
<div class="outline-text-3" id="text-org9747ea5">
<ul class="org-ul">
<li>State "CALENDAR"   from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-20 Wed 09:06] </span></span> <br>
H5 应用的时候处理提示语部分。</li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-19 Tue 09:21]</span></span>
</p>
</div>
</div>

<div id="outline-container-org2afd4e8" class="outline-3">
<h3 id="org2afd4e8"><span class="todo CALENDAR">CALENDAR</span> 流程设计发起人、审批人、抄送人高级选项</h3>
<div class="outline-text-3" id="text-org2afd4e8">
<ul class="org-ul">
<li>State "CALENDAR"   from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-19 Tue 09:10]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-19 Tue 09:08]</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-orgad2ad10" class="outline-2">
<h2 id="orgad2ad10">PRJ</h2>
<div class="outline-text-2" id="text-orgad2ad10">
</div>
<div id="outline-container-org666615e" class="outline-3">
<h3 id="org666615e"><span class="todo PROJECT">PROJECT</span> 阅读 JavaScript 书籍</h3>
<div class="outline-text-3" id="text-org666615e">
<ul class="org-ul">
<li>State "PROJECT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-09 Sat 10:51] </span></span> <br>
<ul class="org-ul">
<li>《高级 JavaScript 程序设计》</li>
<li>《你不知道的 JavaScript 》</li>
</ul></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-08 Fri 19:14]</span></span>
</p>
</div>
</div>

<div id="outline-container-org6d615d4" class="outline-3">
<h3 id="org6d615d4"><span class="todo PROJECT">PROJECT</span> 简要了解整个 Web 开发技术栈</h3>
<div class="outline-text-3" id="text-org6d615d4">
<ul class="org-ul">
<li>State "PROJECT"    from "SOMEDAY"    <span class="timestamp-wrapper"><span class="timestamp">[2020-05-09 Sat 11:21] </span></span> <br>
概要了解，不要深入，用来关注当前领域范围和趋势。</li>
<li>State "SOMEDAY"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-08 Fri 09:39]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-07 Thu 19:17]</span></span>
</p>

<p>
参阅该清单 <a href="web-developer-roadmap.html">Web Developer Roadmap ←</a> 。
</p>
</div>
</div>
</div>

<div id="outline-container-orgb055967" class="outline-2">
<h2 id="orgb055967">WAT</h2>
<div class="outline-text-2" id="text-orgb055967">
</div>
<div id="outline-container-org9654d72" class="outline-3">
<h3 id="org9654d72"><span class="todo WAIT">WAIT</span> 系统模板配置</h3>
<div class="outline-text-3" id="text-org9654d72">
<ul class="org-ul">
<li>State "WAIT"       from "CALENDAR"   <span class="timestamp-wrapper"><span class="timestamp">[2020-05-21 Thu 09:23] </span></span> <br>
等待产品去做。</li>
<li>State "CALENDAR"   from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-21 Thu 09:23]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-21 Thu 09:23]</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-orgd5c12fc" class="outline-2">
<h2 id="orgd5c12fc">MAY</h2>
<div class="outline-text-2" id="text-orgd5c12fc">
</div>
<div id="outline-container-org873ee8b" class="outline-3">
<h3 id="org873ee8b"><span class="todo SOMEDAY">SOMEDAY</span> 制作饮食、睡眠、运动计划清单</h3>
<div class="outline-text-3" id="text-org873ee8b">
<ul class="org-ul">
<li>State "SOMEDAY"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-20 Wed 09:07] </span></span> <br>
尽快哦！</li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-19 Tue 10:28]</span></span>
</p>
</div>
</div>

<div id="outline-container-orge51195f" class="outline-3">
<h3 id="orge51195f"><span class="todo SOMEDAY">SOMEDAY</span> GTD 整理</h3>
<div class="outline-text-3" id="text-orge51195f">
<ul class="org-ul">
<li>State "SOMEDAY"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-07 Thu 09:21]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-01 Fri 20:51]</span></span>
</p>
</div>
</div>

<div id="outline-container-org0ae529f" class="outline-3">
<h3 id="org0ae529f"><span class="todo SOMEDAY">SOMEDAY</span> 清理导航页书签</h3>
<div class="outline-text-3" id="text-org0ae529f">
<ul class="org-ul">
<li>State "SOMEDAY"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-07 Thu 09:22] </span></span> <br>
利用零碎时间进行处理。</li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-06 Wed 18:11]</span></span>
</p>
</div>
</div>

<div id="outline-container-org1444c15" class="outline-3">
<h3 id="org1444c15"><span class="todo SOMEDAY">SOMEDAY</span> 了解 Websocket 即时通讯</h3>
<div class="outline-text-3" id="text-org1444c15">
<ul class="org-ul">
<li>State "SOMEDAY"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-07 Thu 14:08] </span></span> <br>
H5 应用端及时消息要用到该技术栈。</li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-07 Thu 09:36]</span></span>
</p>
</div>
</div>

<div id="outline-container-org4d4b79d" class="outline-3">
<h3 id="org4d4b79d"><span class="todo SOMEDAY">SOMEDAY</span> 深入了解 Java 技术栈</h3>
<div class="outline-text-3" id="text-org4d4b79d">
<ul class="org-ul">
<li>State "SOMEDAY"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-08 Fri 09:37]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-07 Thu 19:06]</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-org144e603" class="outline-2">
<h2 id="org144e603">DNE</h2>
<div class="outline-text-2" id="text-org144e603">
</div>
<div id="outline-container-org8c9efeb" class="outline-3">
<h3 id="org8c9efeb"><span class="done DONE">DONE</span> 编辑模板</h3>
<div class="outline-text-3" id="text-org8c9efeb">
<ul class="org-ul">
<li>State "DONE"       from "CALENDAR"   <span class="timestamp-wrapper"><span class="timestamp">[2020-06-03 Wed 09:02]</span></span></li>
<li>State "CALENDAR"   from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-20 Wed 09:05]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-20 Wed 09:05]</span></span>
</p>
</div>
</div>

<div id="outline-container-org0f2afa5" class="outline-3">
<h3 id="org0f2afa5"><span class="done DONE">DONE</span> 流程设计条件高级设置</h3>
<div class="outline-text-3" id="text-org0f2afa5">
<ul class="org-ul">
<li>State "DONE"       from "CALENDAR"   <span class="timestamp-wrapper"><span class="timestamp">[2020-06-03 Wed 09:01]</span></span></li>
<li>State "CALENDAR"   from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2020-05-19 Tue 09:10]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-05-19 Tue 09:09]</span></span>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-02-22 Sat 22:25</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2020-06-06 Sat 15:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
